In [1]:
from pandas import DataFrame as df
import pandas as pd
import numpy as np

dates = pd.date_range('1/1/2000', periods=8)

df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C', 'D'])

df

                   A         B         C         D
2000-01-01  0.229908 -0.218498 -0.099196 -0.952504
2000-01-02 -1.377796 -1.313676 -1.673071  0.683369
2000-01-03 -0.259727  0.174235 -0.207577  0.672376
2000-01-04  1.947194 -1.534122 -0.160614  3.335273
2000-01-05 -0.678090  0.754407 -1.127773 -0.442438
2000-01-06 -0.290623  0.268234 -1.956591 -0.049642
2000-01-07 -0.546486 -1.092876  0.521056 -0.273947
2000-01-08  0.626781 -0.136866 -0.374696 -0.179269

In [2]:
print(df.index)
print(df.index[0],type(df.index[0]))

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')
2000-01-01 00:00:00 <class 'pandas._libs.tslib.Timestamp'>

In [3]:
df.iloc[0]

A    0.229908
B   -0.218498
C   -0.099196
D   -0.952504
Name: 2000-01-01 00:00:00, dtype: float64

In [4]:
print(df.index[0].date())
print(df.index[0].to_pydatetime(),type(df.index[0].to_pydatetime()))
print(df.loc[df.index[0]])

2000-01-01
2000-01-01 00:00:00 <class 'datetime.datetime'>
A    0.229908
B   -0.218498
C   -0.099196
D   -0.952504
Name: 2000-01-01 00:00:00, dtype: float64

In [5]:
from datetime import datetime as dt
weekday = dt.strptime('2017-9-3','%Y-%m-%d').weekday()
weekday

6

In [6]:
df.loc[df.index[0]]

A    0.229908
B   -0.218498
C   -0.099196
D   -0.952504
Name: 2000-01-01 00:00:00, dtype: float64

In [7]:
print(type(df.columns))
df.columns

<class 'pandas.core.indexes.base.Index'>

Index(['A', 'B', 'C', 'D'], dtype='object')

In [8]:
dt = {id:dict(df.loc[id]) for id in df.index}
dt

{Timestamp('2000-01-01 00:00:00', freq='D'): {'A': 0.22990834030361576,
  'B': -0.21849831201055936,
  'C': -0.099196236559620288,
  'D': -0.95250441923345708},
 Timestamp('2000-01-02 00:00:00', freq='D'): {'A': -1.3777958334711329,
  'B': -1.3136760956365814,
  'C': -1.6730713079882398,
  'D': 0.68336882026051649},
 Timestamp('2000-01-03 00:00:00', freq='D'): {'A': -0.25972747790489242,
  'B': 0.17423467832345413,
  'C': -0.20757696943789,
  'D': 0.67237620303823631},
 Timestamp('2000-01-04 00:00:00', freq='D'): {'A': 1.9471938463584355,
  'B': -1.5341223521105574,
  'C': -0.16061355794959201,
  'D': 3.3352729775807943},
 Timestamp('2000-01-05 00:00:00', freq='D'): {'A': -0.67808980165597055,
  'B': 0.75440720651074422,
  'C': -1.1277729364841647,
  'D': -0.44243765853811223},
 Timestamp('2000-01-06 00:00:00', freq='D'): {'A': -0.29062315855917692,
  'B': 0.26823408588251785,
  'C': -1.9565906945856923,
  'D': -0.049642164984780641},
 Timestamp('2000-01-07 00:00:00', freq='D'): {'A': -0.54648632622274806,
  'B': -1.0928760658113683,
  'C': 0.52105602385020844,
  'D': -0.27394695025156929},
 Timestamp('2000-01-08 00:00:00', freq='D'): {'A': 0.62678145709632005,
  'B': -0.13686558966775655,
  'C': -0.37469587584589348,
  'D': -0.17926943030652975}}

In [9]:
dict(df)

{'A': 2000-01-01    0.229908
 2000-01-02   -1.377796
 2000-01-03   -0.259727
 2000-01-04    1.947194
 2000-01-05   -0.678090
 2000-01-06   -0.290623
 2000-01-07   -0.546486
 2000-01-08    0.626781
 Freq: D, Name: A, dtype: float64, 'B': 2000-01-01   -0.218498
 2000-01-02   -1.313676
 2000-01-03    0.174235
 2000-01-04   -1.534122
 2000-01-05    0.754407
 2000-01-06    0.268234
 2000-01-07   -1.092876
 2000-01-08   -0.136866
 Freq: D, Name: B, dtype: float64, 'C': 2000-01-01   -0.099196
 2000-01-02   -1.673071
 2000-01-03   -0.207577
 2000-01-04   -0.160614
 2000-01-05   -1.127773
 2000-01-06   -1.956591
 2000-01-07    0.521056
 2000-01-08   -0.374696
 Freq: D, Name: C, dtype: float64, 'D': 2000-01-01   -0.952504
 2000-01-02    0.683369
 2000-01-03    0.672376
 2000-01-04    3.335273
 2000-01-05   -0.442438
 2000-01-06   -0.049642
 2000-01-07   -0.273947
 2000-01-08   -0.179269
 Freq: D, Name: D, dtype: float64}

In [10]:
df.rename(columns={'A':'newA'},inplace = True)
df

                newA         B         C         D
2000-01-01  0.229908 -0.218498 -0.099196 -0.952504
2000-01-02 -1.377796 -1.313676 -1.673071  0.683369
2000-01-03 -0.259727  0.174235 -0.207577  0.672376
2000-01-04  1.947194 -1.534122 -0.160614  3.335273
2000-01-05 -0.678090  0.754407 -1.127773 -0.442438
2000-01-06 -0.290623  0.268234 -1.956591 -0.049642
2000-01-07 -0.546486 -1.092876  0.521056 -0.273947
2000-01-08  0.626781 -0.136866 -0.374696 -0.179269

In [22]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7'],
                    'E': ['E4', 'E5', 'E6', 'E7']},
                    index=[0, 1, 2, 3]) 

frames = [df1, df2]
dfm_new = pd.concat(frames)
dfm_new

    A   B   C   D    E
0  A0  B0  C0  D0  NaN
1  A1  B1  C1  D1  NaN
2  A2  B2  C2  D2  NaN
3  A3  B3  C3  D3  NaN
0  A4  B4  C4  D4   E4
1  A5  B5  C5  D5   E5
2  A6  B6  C6  D6   E6
3  A7  B7  C7  D7   E7

In [23]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [24]:
df2

    A   B   C   D   E
0  A4  B4  C4  D4  E4
1  A5  B5  C5  D5  E5
2  A6  B6  C6  D6  E6
3  A7  B7  C7  D7  E7

In [25]:
dfm_new.loc[0]

    A   B   C   D    E
0  A0  B0  C0  D0  NaN
0  A4  B4  C4  D4   E4

In [26]:
dfm_new2 = pd.concat(frames,ignore_index=True)
dfm_new2

    A   B   C   D    E
0  A0  B0  C0  D0  NaN
1  A1  B1  C1  D1  NaN
2  A2  B2  C2  D2  NaN
3  A3  B3  C3  D3  NaN
4  A4  B4  C4  D4   E4
5  A5  B5  C5  D5   E5
6  A6  B6  C6  D6   E6
7  A7  B7  C7  D7   E7

In [27]:
s1 = pd.to_datetime(pd.Series(['Jul 31, 2009', '2010-01-10', None]))
s1

0   2009-07-31
1   2010-01-10
2          NaT
dtype: datetime64[ns]

In [28]:
s1[2]

NaT

In [29]:
type(s1[2])

pandas._libs.tslib.NaTType

In [36]:
pd.isnull(s1[2])

True

In [37]:
s1[2] ==pd.NaT

False

In [32]:
pd.isNaT(s1[2])

AttributeError: module 'pandas' has no attribute 'isNaT'